[
    {
        "id": "0",
        "project_name": "Snakes and Ladders (Divine Comedy)",
        "about": "It is proposed to make the graphic elements of a video game based on the traditional board game: snakes and ladders, so the board, characters, ladders, snakes and other elements that set the game must be designed.",
        "technologies": "Inkscape",
        "general_project_image": "../../../assets/imgs/s&edc/s&edc_logo.png",
        "objective": "Design all the graphic elements necessary for its implementation in a Snakes and Ladders video game, which is set in the universe of Dante Alighieri's Divine Comedy.",
        "date": "2019",
        "client": "Universitary Student",
        "main_role": "Designer",
        "sec_role": "",
        "sketch": "Firstly, the design of the base box and the video game character was made. The square is created in the likeness of the stone, and the character in the likeness of Dante. As the video game would allow up to four players, the same model was used but with different costume colors.",
        "sketch_image": "../../../assets/imgs/s&edc/s&edc_sketch.png",
        "visual_identity_1": "The Apollo typeface was chosen, since it evokes antiquity like Dante's text, but at the same time something stylized and well cared for.",
        "visual_identity_2": "As for the colors, a mainly analogous palette of brown was chosen, this is because Dante descends to hell, a place that he describes as inside a mountain with brown tones. Likewise, an orange and a yellow to symbolize the fire present in various circles that he visits.",
        "typography_image": "../../../assets/imgs/s&edc/s&edc_typography.png",
        "colors_image": "../../../assets/imgs/s&edc/s&edc_colors.png",
        "solution": "From the base box designed at the beginning, eleven more boxes were made, each one representing a circle of hell, limbo and paradise, as well as a totally white one to mark the goal box. Each square of these was placed in a horizontal row of 10 spaces, so that 10 squares were positioned on the board for each circle.",
        "solution_image": "../../../assets/imgs/s&edc/s&edc_solution.png",
        "implementations_1": "In the functionality of the video game there must be ladders and snakes, so for these a white piece of land and a centipede were selected, respectively, which with their colors symbolized the proximity to paradise (white) and its distance (black).",
        "implementations_2": "In addition, other decorative elements were designed for the edges of the screen, such as a flame that reminds us that we are inside the Divine Comedy.",
        "implementations_image": "../../../assets/imgs/s&edc/s&edc_implementations.png",
        "learning_1": "Analogous colors:",
        "learning_1_description": "These allow objects with solid shadows to be degraded very well, allowing depth to be given to objects even if they do not have it.",
        "learning_2": "Elements divided into plugins:",
        "learning_2_description": "When an element that changes its size due to dependencies must be made, it is important to design it in a segmented way, because that way it can be increased or decreased as much as you like, for example the centipede.",
        "learning_3": "Environment:",
        "learning_3_description": "It is essential that what we are developing has an adequate environment, that it achieves the initial objective."
    },
    {
        "id": "1",
        "project_name": "Angela's Nightmare",
        "about": "This video game was born from the need to deliver a university project. The video game is set in the nightmares of a girl, and how the loneliness and lack of attention from her parents can have a negative impact on her.",
        "technologies": "Inkscape | Java | Apache Netbeans | JSON",
        "general_project_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_logo.png",
        "objective": "Create a video game with the knowledge learned in Java, containing certain specific screens and original graphic elements.",
        "date": "2020",
        "client": "University Course",
        "main_role": "UX | UI Designer",
        "sec_role": "Developer",
        "sketch": "The first thing that was done after raising the story was the graphic style, so the main character was designed. A sketch was made on paper first and then vectorized in Inkscape.",
        "sketch_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_sketch.png",
        "visual_identity_1": "It has a single font: Ink Free, which with the selected color palette allows us to generate a tense and dark environment. It works to remind us that we are living Angela's nightmares in our own body.",
        "visual_identity_2": "The color palette is analogous between black and white, since it is intended to generate a dark and gloomy environment, in addition to saturating the composition a little to generate loneliness, despair, fear and sadness.",
        "typography_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_typography.png",
        "colors_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_colors.png",
        "solution": "Other graphic elements were generated that not only provided the video game with functionalities, but also allowed them to be used statically in backgrounds, screens, instructions, and others.",
        "solution_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_solution.png",
        "implementations_1": "Two fundamental elements in the video game are the boxes and the stairs, since with these we will be able to solve puzzles and move forward, since they allow us to climb places that we cannot access without them.",
        "implementations_2": "In addition, there are other more dynamic elements that incorporate other features such as the lever and the cage, since they allow us to enable new spaces, or obstruct them, respectively.",
        "implementations_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_implementations.png",
        "learning_1": "Level design:",
        "learning_1_description": "The levels in a video game are fundamental, so each level must be thought out and developed as well as possible, since they are not only there to pass them, but also to tell us a story.",
        "learning_2": "Functionality-Aesthetics:",
        "learning_2_description": "Another point to consider is the relationship between a functionality and the graphic elements that surround it, since there must be harmony between both and they must agree so that the video game looks good in both aspects.",
        "learning_3": "Audio:",
        "learning_3_description": "It is essential to use music and sounds according to the theme, since it provides a great enrichment to the video game."
    },
    {
        "id": "2",
        "project_name": "KIARA Goddess",
        "about": "Kiara Goddess is a Costa Rican startup focused on the sale of women's beauty products, both makeup and skin care. Its catalog is as broad as its customers, so it must ensure a corporate image that reflects inclusion as its business.",
        "technologies": "Inkscape | Figma",
        "general_project_image": "../../../assets/imgs/kiara/kiara_logo.png",
        "objective": "Create a complete visual identity for the business that reflects the beauty of women, as well as their finesse, delicacy and strength. It is proposed to make an imagotype, which has both horizontal and compact signatures; as well as the preparation of its own brand manual with different graphic elements.",
        "date": "2020",
        "client": "KIARA Goddess",
        "main_role": "Designer",
        "sec_role": "",
        "sketch": "In the first instance, after having collected enough information from the client, the creation of the logo began. Different ideas were proposed, but the one that best suited the client's needs was the one that presented a large name with the slogan in a cursive font; also that it presented an element that would later be very representative for the brand: the Lotus Flower.",
        "sketch_image": "../../../assets/imgs/kiara/kiara_sketch.png",
        "visual_identity_1": "The brand should evoke a very feminine style, both in colors and fonts. Titan One is the main typeface of the logo, since due to its thickness it allows us to reflect strength, stability and variety of products and customers. For its part, Cutie Cupid reminds us of the delicacy, fineness and style that women possess, as well as evoking the divinity that it reflects. Ultimately, Roboto was selected as the font for long documents, due to its ease of reading and simplicity.",
        "visual_identity_2": "As for the colors chosen for the brand, a palette of analogous colors was chosen, which in this case are shades of pink, encompassing five different shades that reflect the woman and the beauty items she uses. Finally, the palette has a golden color that recalls divinity.",
        "typography_image": "../../../assets/imgs/kiara/kiara_typography.png",
        "colors_image": "../../../assets/imgs/kiara/kiara_colors.png",
        "solution": "Using the previous distinctive elements, an imagotype was made, since the idea is that it be functional regardless of the size in which it is displayed. Likewise, the lotus flower is the most important and symbolic graphic element of the brand. The corresponding colors were applied and their spacing was worked on, with horizontal and compact signatures.",
        "solution_image": "../../../assets/imgs/kiara/kiara_solution.png",
        "implementations_1": "Within the implementations that the visual identity has, the stickers are presented, which contain the entire essence of the brand and will be used to seal the packages sent. And thank you cards are a good way to present the gratitude that the company has with its customers, also capturing the essence of the business.",
        "implementations_2": "As for graphic material designed for digital use, Instagram posts and stories contain the colors and visual image, with their horizontal and compact signatures, respectively.",
        "implementations_image": "../../../assets/imgs/kiara/kiara_implementations.png",
        "learning_1": "Importance of the initial brief:",
        "learning_1_description": "Carrying out a brief at the beginning of each project is essential, since it allows us to understand the needs and wishes of the client, as well as a basis for brainstorming the design.",
        "learning_2": "Standard measurements:",
        "learning_2_description": "Investigating about the different measures used by social networks, or the standard sizes of graphic elements in print is essential, since all the measures must coincide with your means of diffusion so that there are no errors.",
        "learning_3": "Measurement X:",
        "learning_3_description": "It is fundamental in the creation of any graphic element to define a standard measure (x), so that all the elements are proportional to said measure."
    },
    {
        "id": "3",
        "project_name": "WLARA Design",
        "about": "Own entrepreneurship focused on working as a Freelancer and increasing knowledge about myself in the workplace. It is made up of two fundamental axes, design and software development, however it mainly refers to the graphic area.",
        "technologies": "Inkscape | Figma",
        "general_project_image": "../../../assets/imgs/wlarad/wlarad_logo.png",
        "objective": "Create a complete visual identity that reflects the principles and ideas of graphic design and software development, as well as the identification of my person from a graphic identifier.",
        "date": "2021",
        "client": "Personal Project",
        "main_role": "Designer",
        "sec_role": "",
        "sketch": "Various sketches were made with fundamental ideas such as the importance of the W, because being a personal brand it is the most representative element. Regarding the graphic design part, the idea of a pen is taken, characteristic in the use of vectors. By combining the letter and the pen we are left with the main graphic identifier of the brand.",
        "sketch_image": "../../../assets/imgs/wlarad/wlarad_sketch.png",
        "visual_identity_1": "Three different fonts were chosen: Heaters, in order to evoke strength, creativity due to its stroke and art; Apollo to bring elegance and seriousness to both the brand and its documents; and Roboto for correct legibility of long texts.",
        "visual_identity_2": "As for its colors, it has similar blue colors that evoke the confidence and seriousness of the undertaking. As well as two golden tones to reflect the finesse with which the work is carried out, as well as its quality.",
        "typography_image": "../../../assets/imgs/wlarad/wlarad_typography.png",
        "colors_image": "../../../assets/imgs/wlarad/wlarad_colors.png",
        "solution": "By mixing the fonts, colors and the selected identifier, the two main signatures of the brand are created: the compact and the horizontal, which respectively work in small spaces or social networks, and in spaces that allow their use as prints or wide elements.",
        "solution_image": "../../../assets/imgs/wlarad/wlarad_solution.png",
        "implementations_1": "Business cards and the planner are good examples of how to use identifiers on physical items.",
        "implementations_2": "While the remaining two work for publication on social networks and digital media.",
        "implementations_image": "../../../assets/imgs/wlarad/wlarad_implementations.png",
        "learning_1": "Make yourself known:",
        "learning_1_description": "It is very important that people know our work, that they know that we exist and that we do a good job.",
        "learning_2": "Identity:",
        "learning_2_description": "It is essential and indisputable that the identifier we make must be as faithful to our tastes and preferences so that we not only feel attached to the brand but also so that people can have a reflection of the person behind the brand.",
        "learning_3": "Pregnancy:",
        "learning_3_description": "The easier a graphic identifier design is to remember, it is better. This is because it will be easier for people to remember a simple logo that they saw for a few seconds, than a more complex one in the same period of time."
    },
    {
        "id": "4",
        "project_name": "Kim Lara",
        "about": "Personal brand focused on muscle training. It aims to express that not only men exercise, but there is also a wide niche of women who also practice this and other sports.",
        "technologies": "Inkscape",
        "general_project_image": "../../../assets/imgs/kimlara/kimlara_logo.png",
        "objective": "Create a complete visual identity that reflects the values of the company. That shows the strength and courage that should exist when training, but without neglecting that the brand focuses mainly on women.",
        "date": "2021",
        "client": "Kimberly Lara",
        "main_role": "Designer",
        "sec_role": "",
        "sketch": "Different ideas were made for the identifier that combined the name of the coach, elements of the discipline and references to exercises, however the one that best adhered and contained the most seriousness was the central design.",
        "sketch_image": "../../../assets/imgs/kimlara/kimlara_sketch.png",
        "visual_identity_1": "A single typeface is chosen, in this case Gabriola. This typeface allows us to express femininity due to its style and dynamism. This is complemented by 'Kim Lara' which are written in custom fonts.",
        "visual_identity_2": "As for the colors chosen, gray, red and green tones are included, this to achieve a balance between seriousness and professionalism (black), strength and courage (red) and health (green). Similarly, these colors refer to the colors of the weight plates used in Power Lifting.",
        "typography_image": "../../../assets/imgs/kimlara/kimlara_typography.png",
        "colors_image": "../../../assets/imgs/kimlara/kimlara_colors.png",
        "solution": "The integration of the above elements would form the visual identifier of Kim Lara, a brand with a lot of personality and reference to sports and the female audience.",
        "solution_image": "../../../assets/imgs/kimlara/kimlara_solution.png",
        "implementations_1": "Only the graphic identifier was made, so it does not have graphic implementations.",
        "implementations_2": "It is more set to its use digitally.",
        "implementations_image": "../../../assets/imgs/kimlara/kimlara_implementations.png",
        "learning_1": "Personalization:",
        "learning_1_description": "Despite having designed a logo with a lot of pregnancies, I think it could have been improved in terms of custom fonts.",
        "learning_2": "Shadows:",
        "learning_2_description": "You have to know how to implement shadows in designs, mainly in identifiers, since it is not recommended, but if it is used in a good way, integrating each element and providing a little depth, it is achieved without a problem.",
        "learning_3": "Unnecessary items:",
        "learning_3_description": "It is essential to reduce the identifier as much as possible and eliminate elements that are considered unnecessary or repetitive."
    },
    {
        "id": "5",
        "project_name": "Real Tickets",
        "about": "Website through which the user can purchase tickets to events with various categories, registering the number of seats depending on the type of seat (adult or child).",
        "technologies": "PHP | HTML | CSS | JavaScript | SCSS | Figma",
        "general_project_image": "../../../assets/imgs/realtickets/realtickets_logo.png",
        "objective": "Create the frontend of a website focused on the sale of tickets online, for different types of events: Artistic, Cinematic, Academic, etc; through which you can reserve spaces and search for events by keywords.",
        "date": "2021",
        "client": "University Course",
        "main_role": "UX | UI Designer",
        "sec_role": "Web Developer",
        "sketch": "The construction of a grayscale wireframe was carried out to visualize the tonalities and arrangements of the objects, in order to exchange sectors and select the most appropriate to transmit a message or information with a specific order.",
        "sketch_image": "../../../assets/imgs/realtickets/realtickets_sketch.png",
        "visual_identity_1": "A sans serif typeface was chosen for easy reading on electronic devices. In addition, it was taken into account that it has a youthful style due to its few edges, allowing it to reach the desired audience more easily.",
        "visual_identity_2": "Regarding the color palette of the site, blue tones were chosen mostly to evoke confidence in the user when making reservations on the website, as well as a yellow tone for the call to action and the connection with youth.",
        "typography_image": "../../../assets/imgs/realtickets/realtickets_typography.png",
        "colors_image": "../../../assets/imgs/realtickets/realtickets_colors.png",
        "solution": "By combining figures with rounded corners, fonts and the chosen color palette, a very youthful website is obtained, with little information, easy to read and that is concise with its links.",
        "solution_image": "../../../assets/imgs/realtickets/realtickets_solution.png",
        "implementations_1": "The implementation of a personalized search bar that took into account event keywords was carried out. Likewise, we worked with rounded cards, which are more pleasing to the eye, with their respective information and call to action.",
        "implementations_2": "In addition, it contains a registration form to make the reservations of the spaces in the name of the user who uses the web application, as well as a summary page where all the pertinent data of the reservation made is shown.",
        "implementations_image": "../../../assets/imgs/realtickets/realtickets_implementations.png",
        "learning_1": "Wireframe:",
        "learning_1_description": "Working with the idea and its sections at the beginning is easier with a wireframe, since it allows a broader creative process by being able to move a block from one sector to another.",
        "learning_2": "Mockup:",
        "learning_2_description": "Being able to visualize the frontend of the site in a design program allows a better idea of the final product, as well as its fundamental function as a guide in the process of passing it to code.",
        "learning_3": "Surveys:",
        "learning_3_description": "It is essential to know what future end users think, since the website must be attractive to them."
    },
    {
        "id": "6",
        "project_name": "Fuente de Poder y Fe",
        "about": "Christian church that wanted to make a change to its graphic identifier. It was intended to make it simpler for greater pregnancy and for its correct embroidery on shirts.",
        "technologies": "Inkscape",
        "general_project_image": "../../../assets/imgs/fuentepoderfe/fuentepoderfe_logo.png",
        "objective": "Redesign the graphic identifier of the Fuente de Poder y Fe church, preserving the colors of the church and some graphic elements.",
        "date": "2021",
        "client": "Christian Church Fuente de Poder y Fe",
        "main_role": "Graphic Designer",
        "sec_role": "",
        "sketch": "Taking the current logo (left) as a starting point, new proposals were brainstormed (center), of which two were selected and converted to vectors (right).",
        "sketch_image": "../../../assets/imgs/fuentepoderfe/fuentepoderfe_sketch.png",
        "visual_identity_1": "A sans serif typeface was chosen for a correct reading in virtual and reduced spaces. Capital letters are mainly used so that all the characters maintain the same height, to evoke the equality with which God looks at us.",
        "visual_identity_2": "As for the selected colors, the original colors are maintained, which share meaning with the colors of the Costa Rican flag: red (blood of God), white (peace) and blue (sky and sea).",
        "typography_image": "../../../assets/imgs/fuentepoderfe/fuentepoderfe_typography.png",
        "colors_image": "../../../assets/imgs/fuentepoderfe/fuentepoderfe_colors.png",
        "solution": "The default graphic identifier is made up of all the colors in the palette, however on dark backgrounds the identifier becomes completely white.",
        "solution_image": "../../../assets/imgs/fuentepoderfe/fuentepoderfe_solution.png",
        "implementations_1": "Se cre칩 un flyer para promocionar cursos libres de idiomas en la zona, al cual se le a침adi칩 el nuevo identificador gr치fico.",
        "implementations_2": "This has been developed to be published and shared on social networks such as Facebook, Instagram and Whatsapp.",
        "implementations_image": "../../../assets/imgs/fuentepoderfe/fuentepoderfe_implementations.png",
        "learning_1": "Investigation:",
        "learning_1_description": "You should always research about the client, not only their history, but also the history behind their business.",
        "learning_2": "Compact version:",
        "learning_2_description": "The graphic identifier must be versatile enough to be well distinguished in reduced sizes, or have its corresponding adaptation.",
        "learning_3": "Contact with the client:",
        "learning_3_description": "There must be communication with the client, to know what they want and what requirements they must meet."
    },
    {
        "id": "7",
        "project_name": "Tierra a la Vista",
        "about": "Video game made by three people that complies with the theory of the game and the theory of fun, from external assets.",
        "technologies": "C# | Unity 3D",
        "general_project_image": "../../../assets/imgs/tierraalavista/tierraalavista_logo.png",
        "objective": "Develop and implement a 3D video game that increases in difficulty over time, using free third-party assets. In addition, you must have a scoring system to be able to compete for the best position among players.",
        "date": "2021",
        "client": "University Course",
        "main_role": "Developer",
        "sec_role": "",
        "sketch": "Different maps of ideas were made to develop the different functionalities that the video game has. In the image you can see a sketch of the direction idea to move the player.",
        "sketch_image": "../../../assets/imgs/tierraalavista/tierraalavista_sketch.png",
        "visual_identity_1": "Fonts related to the pirate theme were sought, so two were chosen: one more serious to evoke the importance of the subject and another more childish to accompany the animated graphics of the video game.",
        "visual_identity_2": "As for the color palette, shades were chosen that were reminiscent of the sea, sand and treasure chests.",
        "typography_image": "../../../assets/imgs/tierraalavista/tierraalavista_typography.png",
        "colors_image": "../../../assets/imgs/tierraalavista/tierraalavista_colors.png",
        "solution": "Several functionalities were considered, among them the movement of the player and the chase of the enemies that attack with cannons (left); and recovering ammo with cannons and gaining an invincibility powerup with a bottle (right).",
        "solution_image": "../../../assets/imgs/tierraalavista/tierraalavista_solution.png",
        "implementations_1": "Various screens were implemented in the video game, among them is the instruction screen to learn how to use the controls.",
        "implementations_2": "On the other hand, there is the credit screen, in which the assets and music used are recognized, as well as their developers.",
        "implementations_image": "../../../assets/imgs/tierraalavista/tierraalavista_implementations.png",
        "learning_1": "Repository:",
        "learning_1_description": "When teamwork is carried out, in which several people are going to modify a project, the use of a Git-style repository is of the utmost importance to load and upload the changes. Likewise, the versioning of the project and its division into different branches is important.",
        "learning_2": "Tests:",
        "learning_2_description": "Whenever a project is carried out in which the user will be able to interact directly with it, a testing stage is required to polish the details and eliminate errors.",
        "learning_3": "Funcionality:",
        "learning_3_description": "In essence, a video game is a set of functionalities, so you have to know which ones to choose so that they provide gameplay, history or level design."
    },
    {
        "id": "8",
        "project_name": "aMonchar!",
        "about": "Android mobile application as a web recipe book in which users can register and upload their custom recipes stored by categories.",
        "technologies": "Java | Android Studio | Inkscape",
        "general_project_image": "../../../assets/imgs/amonchar/amonchar_logo.png",
        "objective": "Develop and implement a mobile application on Android with connection to an external API, a non-relational database and a user account system.",
        "date": "2021",
        "client": "University Course",
        "main_role": "Developer",
        "sec_role": "Logo designer",
        "sketch": "First, the sketch and preparation of the application logo was made, as well as its icon version in the device's application gallery.",
        "sketch_image": "../../../assets/imgs/amonchar/amonchar_sketch.png",
        "visual_identity_1": "An easy-to-read font was used in digital media, which in turn is quite youthful, allowing for more direct contact with the target audience.",
        "visual_identity_2": "As for the colors, two neutral tones were used, one dark and one light, and two tones that provoke the sensation of hunger and are associated with food as they are warm tones.",
        "typography_image": "../../../assets/imgs/amonchar/amonchar_typography.png",
        "colors_image": "../../../assets/imgs/amonchar/amonchar_colors.png",
        "solution": "We opted for a lightly loaded design, very visual. The database is managed from Firebase in a non-relational way, allowing the sharing of various recipes among all the users of the application.",
        "solution_image": "../../../assets/imgs/amonchar/amonchar_solution.png",
        "implementations_1": "Various screens of the application were implemented, including the main one that shows the cards of all the recipes that are registered in the application. In addition, there is the user profile which allows the user to modify their account information, as well as add new recipes to the application and create a weekly meal plan.",
        "implementations_2": "Likewise, the application contains different types of searches, among them the general ones that search for coincidences in the titles of the recipes or those of categories, as well as a search by ingredients in a recipe.",
        "implementations_image": "../../../assets/imgs/amonchar/amonchar_implementations.png",
        "learning_1": "API:",
        "learning_1_description": "Being able to connect our applications to external APIs allows us to easily obtain information that is already centralized.",
        "learning_2": "Firebase:",
        "learning_2_description": "A cloud service like this allows you to store data that can be consulted from different devices that only need to be connected to the internet.",
        "learning_3": "Permissions on Android:",
        "learning_3_description": "To use different services or elements of our cell phone in the application, the necessary permissions must be added in the manifest of our project."
    },
    {
        "id": "9",
        "project_name": "Personal Portfolio",
        "about": "Personal web portfolio with the possibility of contact by email from a form in the contact section.",
        "technologies": "Angular | HTML | CSS | TypeScript | JSON",
        "general_project_image": "../../../assets/imgs/wlaraportfolio/wlaraportfolio_logo.png",
        "objective": "Design and develop a web portfolio that contains a direct contact method and a specific page for each project.",
        "date": "2022",
        "client": "Personal Project",
        "main_role": "UX | UI Designer",
        "sec_role": "Web Developer",
        "sketch": "In the first instance, a wireframe of the site is made in which it works with gray scale and information blocks, to determine the space and sizes necessary for a correct visualization.",
        "sketch_image": "../../../assets/imgs/wlaraportfolio/wlaraportfolio_sketch.png",
        "visual_identity_1": "A sans serif font is implemented for easy reading in digital media. Likewise, it is worth mentioning that it is the one stipulated in the WLARA Design brand manual.",
        "visual_identity_2": "As for the colors, those of the WLARA Design brand were used, selecting a light background that is pleasant to the eye and that does not tire much over time.",
        "typography_image": "../../../assets/imgs/wlaraportfolio/wlaraportfolio_typography.png",
        "colors_image": "../../../assets/imgs/wlaraportfolio/wlaraportfolio_colors.png",
        "solution": "With the implementation of the colors in the wireframe and the projects loaded through a JSON, harmony is achieved on the site. In addition, its design and responsive implementation is carried out.",
        "solution_image": "../../../assets/imgs/wlaraportfolio/wlaraportfolio_solution.png",
        "implementations_1": "All the pages of the site are made in a responsive way. Likewise, a main page is implemented that shows all the initial data necessary for users who enter the site, as well as a contact page to make direct contact by email.",
        "implementations_2": "A hamburger menu is implemented for proper site navigation on devices with screen sizes less than 1920 pixels wide. In addition, the about section is adapted for easy reading and composition.",
        "implementations_image": "../../../assets/imgs/wlaraportfolio/wlaraportfolio_implementations.png",
        "learning_1": "Angular:",
        "learning_1_description": "Being a framework that is rendered on the client side, considerations must be taken so that the information is displayed correctly and in real time.",
        "learning_2": "JSON:",
        "learning_2_description": "The loading of all the information of the projects and the photographs are loaded dynamically through JSON files, a simple methodology due to its structure.",
        "learning_3": "Host:",
        "learning_3_description": "To maintain a website on the network, it must be stored on a host, so your search, whether free or paid, must be as thorough as possible so that it meets our requirements."
    }
]