[
    {
        "id": "0",
        "project_name": "Serpientes y Escaleras (Divina Comedia)",
        "about": "Se plantea realizar los elementos gráficos de un vidojuego basado en el tradicional juego de mesa: serpientes y escaleras, por lo que se debe diseñar el tablero, personajes, escaleras, serpientes y demás elementos que ambienten el juego.",
        "general_project_image": "../../../assets/imgs/s&edc/s&edc_logo.png",
        "objective": "Diseñar todos los elementos gráficos necesarios para su implementación en un vidojuego tipo Serpientes y Escaleras, que se ambiente en el universo de la Divina Comedia de Dante Alighieri.",
        "date": "2019",
        "client": "Estudiante Universitario",
        "main_role": "Diseñador",
        "sec_role": "",
        "sketch": "Primeramente se realizó el diseño de la casilla base y del personaje del videojuego. La casilla está creada a semejanza de la piedra, y el personaje a semejanza de Dante. Como el videojuego permitiría hasta cuatro jugadores, se utilizó el mismo modelo pero con colores de vestuario distintos.",
        "sketch_image": "../../../assets/imgs/s&edc/s&edc_sketch.png",
        "visual_identity_1": "Se eligió la tipografía Apollo, ya que nos evoca a la antigüedad como el texto de Dante, pero a su vez a algo estilizado y bien cuidado.",
        "visual_identity_2": "En cuanto a los colores se optó por una paleta principalmente análoga de color café, esto debido a que Dante baja al infierno lugar que describe como dentro de una montaña con tonos café. Asimismo, un naranja y un amarillo para simbolizar el fuego presente en varios círculos que visita.",
        "typography_image": "../../../assets/imgs/s&edc/s&edc_typography.png",
        "colors_image": "../../../assets/imgs/s&edc/s&edc_colors.png",
        "solution": "A partir de casilla base diseñada al inicio, se realizaron once casillas más, cada una representanco un círculo del infierno, el limbo y el paraíso, así como una totalmente blanca para señalizar la casilla de meta. Cada casilla de estas se colocó en fila horizontal de 10 espacios, por lo que en el tablero se posicionaban 10 casillas por cada círculo.",
        "solution_image": "../../../assets/imgs/s&edc/s&edc_solution.png",
        "implementations_1": "En la funcionalidad del videojuego deben haber escaleras y serpientes, por lo que para estas se seleccionó un trozo de tierra blanca y un cienpies respectivamente, que con sus colores simbolizaban la cercanía al paraíso (blanco) y su lejanía (negro).",
        "implementations_2": "Además, se diseñaron otros elementos decorativos para los bordes de la pantalla, como lo es un llamas que nos recuerdan que estamos dentro de la Divina Comedia.",
        "implementations_image": "../../../assets/imgs/s&edc/s&edc_implementations.png",
        "learning_1": "Colores análogos:",
        "learning_1_description": "Estos permiten degradar muy bien objetos con sombras sólidas, permitiendo dar profundidad a los objetos aunque no la tengan.",
        "learning_2": "Elementos divididos en complementos:",
        "learning_2_description": "Cuando se debe realizar un elemento que cambia su tamaño por dependencias, es importante diseñarlo de forma segmentada, porque así se podrá aumentar o disminuir cuanto uno guste, por ejemplo el cienpies..",
        "learning_3": "Ambiente:",
        "learning_3_description": "Es fundamental que lo que estemos desarrollando posea un ambiente adecuado, que logre cumplir con el objetivo inicial."
    },
    {
        "id": "1",
        "project_name": "Angela's Nightmare",
        "about": "Este videojuego nace a partir de la necesidad de entregar un trabajo universitario. El videojuego se ambienta en las pesadillas de una niña, y como la soledad y falta de atención por parte de sus padres puede impactar negativamente en ella.",
        "general_project_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_logo.png",
        "objective": "Crear un videojuego con los conocimientos aprendidos en Java, que contenga ciertas pantallas en específico y elementos gráficos originales.",
        "date": "2020",
        "client": "Curso Universitario",
        "main_role": "Programador",
        "sec_role": "Diseñador",
        "sketch": "Lo primero que se realizó después de plantear la historia fue el estilo gráfico, por lo que se diseñó la personaje principal. Se realizó un boceto en papel primero para después ser vectorizado en Inkscape.",
        "sketch_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_sketch.png",
        "visual_identity_1": "Cuenta con una sola tipografía: Ink Free, la cual con la paleta de colores seleccionada nos permite generar un ambiente tenso y oscuro. Funciona para recordarnos que estamos viviendo las pesadillas de Angela en nuestro propio cuerpo.",
        "visual_identity_2": "La paleta de colores es de análogos entre negro y blanco, ya que se pretende generar un ambiente oscuro y lúgubre, además de saturar un poco la composición para generar soledad, desesperación, miedo y tristeza.",
        "typography_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_typography.png",
        "colors_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_colors.png",
        "solution": "Se generaron otros elementos gráficos que no solo surtieron de funcionalidades el videojuego, sino que también permitió utilizarlos de manera estática en fondos, pantallas, instrucciones y otros.",
        "solution_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_solution.png",
        "implementations_1": "Dos elementos fundamentales en el videojuego son las cajas y las escaleras, ya que con estas vamos a poder resolver puzzles y avanzar, ya que nos permiten subir a lugares a los que no podemos accesar sin ellas.",
        "implementations_2": "Además, hay otros elementos más dinámicos que incorporan otras funcionalidades como la palanca y la jaula, ya que nos permiten habilitar espacios nuevos, o bien obstruirlos, respectivamente.",
        "implementations_image": "../../../assets/imgs/angelasnightmare/angelasnightmare_implementations.png",
        "learning_1": "Diseño de niveles:",
        "learning_1_description": "Los niveles em un videojuego son fundamentales, por lo que cada nivel debe ser pensado y desarrollado lo mejor posible, ya que no solo están allí para pasarlos, sino también para relatarnos una historia.",
        "learning_2": "Funcionalidad-Estética:",
        "learning_2_description": "Otro punto a considerar es la relación entre una funcionalidad y los elementos gráficos que le rodean, ya que debe haber armonía entre ambos y concordar para que el videojuego se vea bien en ambos aspectos.",
        "learning_3": "Audio:",
        "learning_3_description": "Es indispensable utilizar una música y sonidos acordes a la temática, ya que aporta un gran enriquecimiento al videojuego."
    },
    {
        "id": "2",
        "project_name": "KIARA Goddess",
        "about": "Kiara Goddess es un emprendimiento costarricense enfocado a la venta de productos de belleza femeninos, tanto de maquillaje como de cuidado de la piel. Su catálogo es amplio como sus clientes, por lo que se debe velar por una imagen corporativa que refleje inclusión como su negocio.",
        "general_project_image": "../../../assets/imgs/kiara/kiara_logo.png",
        "objective": "Crear una identidad visual completa para el negocio que refleje la belleza de la mujer, así como su fineza, delicadeza y fuerza. Se plantea realizar un imagotipo, que posea tanto firmas horizontales como compactas; así como la confección de su propio manual de marca con distintos elementos gráficos.",
        "date": "2020",
        "client": "KIARA Goddess",
        "main_role": "Diseñador",
        "sec_role": "",
        "sketch": "En primera instancia, después de haber recopilado la información suficiente del cliente se empezó con la confección del logo. Se propuso diferentes ideas, pero la que mejor se acoplaba a las necesidades del cliente fue la que presentaba nombre en grande con el slogan en una tipografía cursiva; asimismo que presentaba un elemento que posteriormente sería muy representativo para la marca: la Flor de Loto.",
        "sketch_image": "../../../assets/imgs/kiara/kiara_sketch.png",
        "visual_identity_1": "La marca debe evocar un estilo muy femenino, tanto en colores como en tipografías. Titan One es la tipografía principal del logo, ya que debido a su grosor permite reflejarnos fuerza, estabilidad y variedad de productos y clientes. Por su parte Cutie Cupid nos recuerda la delicadeza, fineza y estilo que posee la mujer, así como evocar la divinidad que esta refleja. Por último, Roboto fue seleccionada como tipografía para documentos extensos, debido a su fácil lectura y simplicidad.",
        "visual_identity_2": "En cuanto a los colores elegidos para la marca, se optó por una paleta de colores análogos, que en este caso son tonos rosados, abarcando cinco tonos diferentes que reflejan a la mujer y los artículos de belleza que utiliza. Por último, la paleta posee un color dorado que recuerda la divinidad.",
        "typography_image": "../../../assets/imgs/kiara/kiara_typography.png",
        "colors_image": "../../../assets/imgs/kiara/kiara_colors.png",
        "solution": "Utilizando los elementos distintivos anteriores se procedió a realizar un imagotipo, ya que la idea es que sea funcional sin importar el tamaño en que se muestre. Asimismo, la flor de loto es el elemento gráfico más importante y simbólico de la marca. Se aplicaron los colores correspondientes y se trabajó su espaciado, con firmas horizontales y compactas.",
        "solution_image": "../../../assets/imgs/kiara/kiara_solution.png",
        "implementations_1": "Dentro de las implementaciones que posee la identidad visual se presentan los stickers, que contienen toda la esencia de la marca y se utilizarán para sellar los paquetes enviados. Y las tarjetas de agradecimiento es una buena manera de presentar el agradecimiento que tiene la empresa con sus clientes, capturando de igual modo la esencia del negocio.",
        "implementations_2": "En cuanto a material gráfico diseñado para uso digital, las publicaciones e historias en Instagram contienen los colores e imagen visual, con sus firmas horizontales y compactas respectivamente.",
        "implementations_image": "../../../assets/imgs/kiara/kiara_implementations.png",
        "learning_1": "Importancia del brief inicial:",
        "learning_1_description": "Realizar un brief al inicio de cada proyecto es fundamental, ya que nos permite entender las necesidades y deseos del cliente, así como una base para la lluvia de ideas del diseño.",
        "learning_2": "Medidas estándar:",
        "learning_2_description": "Investigar acerca de las diferentes medidas que utilizan las redes sociales, o los tamaños estándar de los elementos gráficos a impresión es fundamental, ya que todas las medidas deben coincidir con su medio de difusión para que no hayan errores.",
        "learning_3": "Medida X:",
        "learning_3_description": "Es fundamental en la creación de cualquier elemento gráfico la definición de una medida estándar (x), para que todos los elementos sean proporcionales a dicha medida."
    },
    {
        "id": "3",
        "project_name": "WLARA Design",
        "about": "Emprendimiento propio enfocado a trabajar Freelancer y a aumentar el conocimiento acerca de mi persona en el ámbito laboral. Se compone de dos ejes fundamentales, el diseño y el desarrollo de software, sin embargo hace referencia principalmente al área gráfica.",
        "general_project_image": "../../../assets/imgs/wlarad/wlarad_logo.png",
        "objective": "Crear una identidad visual completa que refleje los principios e ideas del diseño gráfico y el dasarrollo de software, así como la identificación de mi persona a partir de un identificador gráfico.",
        "date": "2021",
        "client": "Proyecto Personal",
        "main_role": "Diseñador",
        "sec_role": "",
        "sketch": "Se realizaron diversos bocetos con ideas fundamentales como lo es la importancia de la W, debido a que al ser una marca personal es el elemento más representativo. En cuanto a la parte de diseño gráfico, se toma la idea de una pluma, característica en la utilización de vectores. Al combinar la letra y la pluma nos queda el identificador gráfico principal de la marca.",
        "sketch_image": "../../../assets/imgs/wlarad/wlarad_sketch.png",
        "visual_identity_1": "Se eligieron tres tipografías diferentes: Heaters, con el fin de evocar fuerza, creatividad debido a su trazo y arte; Apollo para aportar elegancia y seriedad tanto a la marca como a sus documentos; y Roboto para una correcta legibilidad de textos extensos.",
        "visual_identity_2": "En cuanto a sus colores, posee colores análogos azules que evocan la confianza y seriedad del emprendimiento. Así como dos tonos dorados para reflejar la fineza con la que se realizan los trabajos, así como su calidad.",
        "typography_image": "../../../assets/imgs/wlarad/wlarad_typography.png",
        "colors_image": "../../../assets/imgs/wlarad/wlarad_colors.png",
        "solution": "Al mezclar las tipografías, colores y el identificador seleccionado se crean los dos firmas principales de la marca: la compacta y la horizontal, las cuales respectivamente funcionan en espacios reducidos o redes sociales, y en espacios que permitan su uso como impresiones o elementos anchos.",
        "solution_image": "../../../assets/imgs/wlarad/wlarad_solution.png",
        "implementations_1": "Las tarjetas de presentación y el planificador son ejemplos claros de cómo utilizar los identificadores en elementos físicos.",
        "implementations_2": "Mientras que los dos restantes funcionan para su publicación en redes sociales y médios digitales.",
        "implementations_image": "../../../assets/imgs/wlarad/wlarad_implementations.png",
        "learning_1": "Darse a conocer:",
        "learning_1_description": "Es muy importante que las personas conozcan nuestro trabajo, que sepan que existimos y que realizamos un buen trabajo.",
        "learning_2": "Identidad:",
        "learning_2_description": "Es indispensable e indiscutible que el identificador que realicemos debe ser lo más fiel a nuestros gustos y preferencias para no solo sentirnos apegados a la marca sino también para que las personas puedan tener un reflejo de la persona que está detrás de la marca.",
        "learning_3": "Pregnancia:",
        "learning_3_description": "Entre más sencillo de recordar sea un diseño de identificador gráfico, mejor. Esto se debe a que las personas le será más sencillo recordar un logo simple que vieron pocos segundos, a uno más complejo en el mismo lapso de tiempo."
    },
    {
        "id": "4",
        "project_name": "Kim Lara",
        "about": "Marca personal enfocada al entrenamiento muscular. Pretende expresar que no solo los hombres hacen ejercicio, sino que también existe un nicho amplio de mujeres que tambien prectican este y otros deportes.",
        "general_project_image": "../../../assets/imgs/kimlara/kimlara_logo.png",
        "objective": "Crear una identidad visual completa que refleje los valores de la empresa. Que muestre la fuerza y el coraje que debe haber al entrenar, pero sin dejar de lado que la marca se enfoca principalmente a las mujeres.",
        "date": "2021",
        "client": "Kimberly Lara",
        "main_role": "Diseñador",
        "sec_role": "",
        "sketch": "Se realizaron diferentes ideas para el identificador que combinaban el nombre de la entrenadora, elementos de la disciplina y y referencias a ejercicios, sin embargo la que mejor se apegaba y contenía mayor seriedad era el diseño central.",
        "sketch_image": "../../../assets/imgs/kimlara/kimlara_sketch.png",
        "visual_identity_1": "Se opta por una sola tipografía, es este caso Gabriola. Esta tipografía nos permite expresar la feminidad debido a su estilo y dinamismo. Esta se complementa con 'Kim Lara' que están escritas en tipografías personalizadas.",
        "visual_identity_2": "En cuanto a los colores elegidos se abarcan tonos grises, rojos y verdes, esto para lograr un equilibrio entre seriedad y profesionalismo (negro), fuerza y valentía (rojo) y la salud (verde). Del mismo modo estos colores hacen referencia a los colores de los discos de peso que se utilizan en el Power Lifting.",
        "typography_image": "../../../assets/imgs/kimlara/kimlara_typography.png",
        "colors_image": "../../../assets/imgs/kimlara/kimlara_colors.png",
        "solution": "La integración de los elementos anteriores formarían el identificador visual de Kim Lara, marca con mucha personalidad y referencia al deporte y al público femenino.",
        "solution_image": "../../../assets/imgs/kimlara/kimlara_solution.png",
        "implementations_1": "Solamente se realizó el identificador gráfico, por lo que no posee implementaciones gráficas.",
        "implementations_2": "Está más ambientado a su uso de manera digital.",
        "implementations_image": "../../../assets/imgs/kimlara/kimlara_implementations.png",
        "learning_1": "Personalización:",
        "learning_1_description": "A pesar de haber diseñado un logo con bastante pregnancia, considero que pudo haberse mejorado en cuanto a las tipografías personalizadas.",
        "learning_2": "Sombras:",
        "learning_2_description": "Hay que saber implementar sombras en diseños, principalmente en identificadores, ya que no se recomienda, pero si se utiliza de buena manera, integrando cada elemento y brindando un poco de profundidad, se logra sin problema.",
        "learning_3": "Elementos innecesarios:",
        "learning_3_description": "Es fundamental reducir al máximo el identificador y eliminar elementos que se crean innecesarios o repetitivos."
    },
    {
        "id": "5",
        "project_name": "Real Tickets",
        "about": "Marca personal enfocada al entrenamiento muscular. Pretende expresar que no solo los hombres hacen ejercicio, sino que también existe un nicho amplio de mujeres que tambien prectican este y otros deportes.",
        "general_project_image": "../../../assets/imgs/realtickets/realtickets_logo.png",
        "objective": "Crear una identidad visual completa que refleje los valores de la empresa. Que muestre la fuerza y el coraje que debe haber al entrenar, pero sin dejar de lado que la marca se enfoca principalmente a las mujeres.",
        "date": "2021",
        "client": "Curso Universitario",
        "main_role": "Diseñador",
        "sec_role": "Desarrollador",
        "sketch": "Se realizaron diferentes ideas para el identificador que combinaban el nombre de la entrenadora, elementos de la disciplina y y referencias a ejercicios, sin embargo la que mejor se apegaba y contenía mayor seriedad era el diseño central.",
        "sketch_image": "../../../assets/imgs/realtickets/realtickets_sketch.png",
        "visual_identity_1": "Se opta por una sola tipografía, es este caso Gabriola. Esta tipografía nos permite expresar la feminidad debido a su estilo y dinamismo. Esta se complementa con 'Kim Lara' que están escritas en tipografías personalizadas.",
        "visual_identity_2": "En cuanto a los colores elegidos se abarcan tonos grises, rojos y verdes, esto para lograr un equilibrio entre seriedad y profesionalismo (negro), fuerza y valentía (rojo) y la salud (verde). Del mismo modo estos colores hacen referencia a los colores de los discos de peso que se utilizan en el Power Lifting.",
        "typography_image": "../../../assets/imgs/realtickets/realtickets_typography.png",
        "colors_image": "../../../assets/imgs/realtickets/realtickets_colors.png",
        "solution": "La integración de los elementos anteriores formarían el identificador visual de Kim Lara, marca con mucha personalidad y referencia al deporte y al público femenino.",
        "solution_image": "../../../assets/imgs/realtickets/realtickets_solution.png",
        "implementations_1": "Solamente se realizó el identificador gráfico, por lo que no posee implementaciones gráficas.",
        "implementations_2": "Está más ambientado a su uso de manera digital.",
        "implementations_image": "../../../assets/imgs/realtickets/realtickets_implementations.png",
        "learning_1": "Personalización:",
        "learning_1_description": "A pesar de haber diseñado un logo con bastante pregnancia, considero que pudo haberse mejorado en cuanto a las tipografías personalizadas.",
        "learning_2": "Sombras:",
        "learning_2_description": "Hay que saber implementar sombras en diseños, principalmente en identificadores, ya que no se recomienda, pero si se utiliza de buena manera, integrando cada elemento y brindando un poco de profundidad, se logra sin problema.",
        "learning_3": "Elementos innecesarios:",
        "learning_3_description": "Es fundamental reducir al máximo el identificador y eliminar elementos que se crean innecesarios o repetitivos."
    }
]